runTest/app/controllers/demo_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def set_user
      # render :text => "id = #{params[:id]}"
      @user = User.find(params[:id])